In [8]:
import pandas as pd

In [10]:
# Load dataset
df=pd.read_csv('raw_data_set.csv')
df

       name   age    salary   join_date
0     Alice  25.0   50000.0  2022-05-10
1       Bob   NaN   45000.0  2021-08-15
2   Charlie  28.0       NaN  2020-11-20
3     David  30.0   55000.0  2022-01-05
4       Eve   NaN   70000.0         NaN
5     Frank  25.0  300000.0  2022-07-01
6     Grace  27.0   48000.0  2021-03-10
7     Alice  25.0   50000.0  2022-05-10
8      Hank   NaN       NaN  2023-02-12
9       Ivy  24.0   52000.0  2022-09-18
10     Jack  26.0   49000.0  2021-06-01

In [11]:
# Remove duplicates
df.drop_duplicates(inplace=True)

In [14]:
# fill missing values
df['name'].fillna('Unknown', inplace=True)
df['salary'].fillna(df['salary'].mean(), inplace=True)
df['join_date'].fillna('2024-01-01', inplace=True)
df['age'].fillna('30',inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_14968\1290886172.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['name'].fillna('Unknown', inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_14968\1290886172.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(), inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_14968\1290886172.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna('30',inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_14968\1290886172.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '30' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df['age'].fillna('30',inplace=True)

In [15]:
# Convert datatype
df['age'] = df['age'].astype(int)
df['salary'] = df['salary'].astype(float)

In [17]:
q1 = df['salary'].quantile(0.25)
q3 = df['salary'].quantile(0.75)
iqr = q3 - q1
df = df[(df['salary'] >= q1 - 1.5 * iqr) & (df['salary'] <= q3 + 1.5 * iqr)]

In [19]:
# Save cleaned dataset
df.to_csv('cleaned_data.csv', index=False)
print("Data cleaned and saved.")

Data cleaned and saved.